import { ArticleContent, ArticleLI, ArticleSubtitle, ArticleText, ArticleTitle } from "./index";
import { Bold, BaseText } from "@components/atoms/texts";
import { Link } from "react-router-dom";

export const CookiesPolicyArticle = () => {
    return (
        <ArticleContent>
            <ArticleTitle>Политика за бисквитки</ArticleTitle>
            <ArticleText style={{marginBottom: "1vh"}}>
                Настоящата Политика за бисквитки обяснява как и защо използваме "бисквитки" (cookies) на нашия уебсайт
                MyTherapy. Тя е част от нашата Политика за поверителност и има за цел да ви информира за
                използването на бисквитки и вашите права във връзка с тях.
            </ArticleText>
            <ArticleSubtitle>1.	Какво са бисквитките </ArticleSubtitle>
            <ArticleText>
                Бисквитките са малки текстови файлове, които се съхраняват на вашето устройство
                (като компютър, смартфон или таблет) при посещение на уебсайт. Те съдържат информация,
                която се използва за идентификация на уникални потребители или за проследяване на
                техните действия във връзка с уебсайта.
            </ArticleText>
            <ArticleSubtitle>2.	Видове бисквитки</ArticleSubtitle>
            <ArticleLI>
                <BaseText>
                    <Bold>Стриктно необходими бисквитки</Bold>: Тези бисквитки са необходими за правилното функциониране на
                    уебсайта и не могат да бъдат изключени в нашата система. Те обикновено се задават само
                    в отговор на действия, извършени от вас, които водят до заявка за услуги, като например настройка
                    на предпочитанията за поверителност, вход в системата или попълване на форми.
                </BaseText>
            </ArticleLI>
            <ArticleLI>
                <BaseText>
                    <Bold>Аналитични бисквитки</Bold>: Тези бисквитки ни позволяват да проследим броя насрещани посетители и
                    да видим как те се движат по уебсайта, като например кои страници посещават и кои функции използват.
                    Тази информация ни помага да подобрим уебсайта и вашето преживяване като потребител.
                </BaseText>
            </ArticleLI>
            <ArticleLI>
                <BaseText>
                    <Bold>Функционални бисквитки</Bold>: Тези бисквитки позволяват на уебсайта да предоставя подобрени
                    функционалности и персонализирани функции. Те могат да бъдат зададени от нас или от трети страни,
                    чиито услуги сме добавили към нашите страници.
                </BaseText>
            </ArticleLI>
            <ArticleSubtitle>3.	Контрол на бисквитките </ArticleSubtitle>
            <ArticleText>
                Можете да контролирате и/или изтриете бисквитките по ваш избор. За повече информация вижте
                <Link to="https://aboutcookies.org"> www.aboutcookies.org</Link> или
                <Link to="https://allaboutcookies.org"> www.allaboutcookies.org</Link>. Можете да изтриете всички бисквитки,
                които вече са съхранени на вашия компютър, и да настроите повечето браузъри така, че да не позволяват
                съхраняването на бисквитки. В този случай обаче е възможно да трябва да регулирате ръчно някои настройки
                при всяко посещение на уебсайта, а определени функции и услуги може да не работят.
            </ArticleText>
            <ArticleSubtitle>4.	Запитвания и контакт </ArticleSubtitle>
            <ArticleText>
                Ако имате въпроси, коментари или запитвания относно тази Cookie Policy, моля,
                свържете се с нас чрез contact.mytherapy@gmail.com
            </ArticleText>
            <ArticleSubtitle>5. Промени в Политиката</ArticleSubtitle>
            <ArticleText>
                Тази Политика може да бъде променяна от време на време за да отразява промени в
                уебсайта или правната ни практика. Всички промени на Cookie Policy ще бъдат публикувани на
                тази страница и важат от момента на публикуването им.
            </ArticleText>
        </ArticleContent>
    )
}